##########################################################################################
#
# oneuifx - by Bit
#
##########################################################################################

##########################################################################################
# 使用说明 / Instructions:
#
# 1. 将要替换的文件放入 system 目录（删除占位文件）
# 2. 在 module.prop 中填写模块信息
# 3. 配置本文件（config.sh）
# 4. 如需开机脚本，可添加到 common/post-fs-data.sh 或 common/service.sh 中
# 5. 如需添加系统属性，可修改 common/system.prop
##########################################################################################

##########################################################################################
# 配置项 / Configs
##########################################################################################

# 是否启用 Magic Mount（大多数模块需要）
SKIPMOUNT=false

# 是否加载 common/system.prop
PROPFILE=false

# 是否启用 post-fs-data 脚本
POSTFSDATA=false

# 是否启用 late_start service 脚本
LATESTARTSERVICE=false

##########################################################################################
# 安装信息 / Installation Message
##########################################################################################

print_modname() {
  ui_print "*******************************"
  ui_print "  oneui音效 for HyperOS 1.8"
  ui_print "  By Bit"
  ui_print "注意：本版本更换 SFX 源设备为 S21FE，旧版本不再维护"
  ui_print "音效包源自三星 S21FE，系统版本 OneUI 6.1"
  ui_print "更新内容详见发布页 Release"
  ui_print "请自备救砖模块，刷机风险自负"
  ui_print "注意：本版本开机动画适用于 Note12T 和 Poco F5，"
  ui_print "      其他机型可能出现分辨率问题"
  ui_print "若显示异常，请进入以下目录："
  ui_print "/data/adb/modules/oneui_fx/system/product/media"
  ui_print "将 bootanimation.zip.bak 重命名为 bootanimation.zip，并删除原文件"
  ui_print "*******************************"
}

##########################################################################################
# 替换列表 / Replace List
##########################################################################################

# 可填写需完整替换的系统路径，如：
# /system/priv-app/SystemUI
REPLACE="
"

##########################################################################################
# 安装过程 / Permissions
##########################################################################################

on_install() {
  ui_print "释放文件中……"
  ui_print "再次提醒：请自备救砖手段，刷死不负责喵！"
  unzip -o "$ZIPFILE" 'system/*' -d $MODPATH >&2
}

set_permissions() {
  # 默认权限配置，适用于大部分情况
  set_perm_recursive $MODPATH 0 0 0755 0644
}

##########################################################################################
# 自定义函数区域 / Custom Functions
##########################################################################################

# 可在此处定义自定义函数，并在 update-binary 中调用